cmsis-svd/cmsis-svd/data/Atmel/ATSAMD21E16B.svd
        <register>
          <name>BUSYCH</name>
          <description>Busy Channels</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BUSYCH0</name>
              <description>Busy Channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSYCH1</name>
              <description>Busy Channel 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSYCH2</name>
              <description>Busy Channel 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSYCH3</name>
              <description>Busy Channel 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSYCH4</name>
              <description>Busy Channel 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSYCH5</name>
              <description>Busy Channel 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSYCH6</name>
              <description>Busy Channel 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSYCH7</name>
              <description>Busy Channel 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSYCH8</name>
              <description>Busy Channel 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSYCH9</name>
              <description>Busy Channel 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSYCH10</name>
              <description>Busy Channel 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSYCH11</name>
              <description>Busy Channel 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PENDCH</name>
          <description>Pending Channels</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PENDCH0</name>
              <description>Pending Channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH1</name>
              <description>Pending Channel 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH2</name>
              <description>Pending Channel 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH3</name>
              <description>Pending Channel 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH4</name>
              <description>Pending Channel 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH5</name>
              <description>Pending Channel 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH6</name>
              <description>Pending Channel 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH7</name>
              <description>Pending Channel 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH8</name>
              <description>Pending Channel 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH9</name>
              <description>Pending Channel 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH10</name>
              <description>Pending Channel 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDCH11</name>
              <description>Pending Channel 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACTIVE</name>
          <description>Active Channel and Levels</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LVLEX0</name>
              <description>Level 0 Channel Trigger Request Executing</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LVLEX1</name>
              <description>Level 1 Channel Trigger Request Executing</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LVLEX2</name>
              <description>Level 2 Channel Trigger Request Executing</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LVLEX3</name>
              <description>Level 3 Channel Trigger Request Executing</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ID</name>
              <description>Active Channel ID</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ABUSY</name>
              <description>Active Channel Busy</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BTCNT</name>
              <description>Active Channel Block Transfer Count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BASEADDR</name>
          <description>Descriptor Memory Section Base Address</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BASEADDR</name>
              <description>Descriptor Memory Base Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WRBADDR</name>
          <description>Write-Back Memory Section Base Address</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WRBADDR</name>
              <description>Write-Back Memory Base Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHID</name>
          <description>Channel ID</description>
          <addressOffset>0x3F</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ID</name>
              <description>Channel ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHCTRLA</name>
          <description>Channel Control A</description>
          <addressOffset>0x40</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Channel Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Channel Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHCTRLB</name>
          <description>Channel Control B</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EVACT</name>
              <description>Event Input Action</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>EVACTSelect</name>
                <enumeratedValue>
                  <name>NOACT</name>
                  <description>No action</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG</name>
                  <description>Transfer and periodic transfer trigger</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTRIG</name>
                  <description>Conditional transfer trigger</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBLOCK</name>
                  <description>Conditional block transfer</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUSPEND</name>
                  <description>Channel suspend operation</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESUME</name>
                  <description>Channel resume operation</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSKIP</name>
                  <description>Skip next block suspend action</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVIE</name>
              <description>Channel Event Input Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVOE</name>
              <description>Channel Event Output Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LVL</name>
              <description>Channel Arbitration Level</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>LVLSelect</name>
                <enumeratedValue>
                  <name>LVL0</name>
                  <description>Channel Priority Level 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL1</name>
                  <description>Channel Priority Level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL2</name>
                  <description>Channel Priority Level 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL3</name>
                  <description>Channel Priority Level 3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGSRC</name>
              <description>Peripheral Trigger Source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <enumeratedValues>
                <name>TRIGSRCSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Only software/event triggers</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGACT</name>
              <description>Trigger Action</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>TRIGACTSelect</name>
                <enumeratedValue>
                  <name>BLOCK</name>
                  <description>One trigger required for each block transfer</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BEAT</name>
                  <description>One trigger required for each beat transfer</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSACTION</name>
                  <description>One trigger required for each transaction</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMD</name>
              <description>Software Command</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>CMDSelect</name>
                <enumeratedValue>
                  <name>NOACT</name>
                  <description>No action</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUSPEND</name>
                  <description>Channel suspend operation</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESUME</name>
                  <description>Channel resume operation</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHINTENCLR</name>
          <description>Channel Interrupt Enable Clear</description>
          <addressOffset>0x4C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TERR</name>
              <description>Transfer Error Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCMPL</name>
              <description>Transfer Complete Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSP</name>
              <description>Channel Suspend Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHINTENSET</name>
          <description>Channel Interrupt Enable Set</description>
          <addressOffset>0x4D</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TERR</name>
              <description>Transfer Error Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCMPL</name>
              <description>Transfer Complete Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSP</name>
              <description>Channel Suspend Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHINTFLAG</name>
          <description>Channel Interrupt Flag Status and Clear</description>
          <addressOffset>0x4E</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TERR</name>
              <description>Transfer Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCMPL</name>
              <description>Transfer Complete</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSP</name>
              <description>Channel Suspend</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHSTATUS</name>
          <description>Channel Status</description>
          <addressOffset>0x4F</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PEND</name>
              <description>Channel Pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>Channel Busy</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FERR</name>
              <description>Fetch Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
